"""
Видео-разбор подвига (решение смотреть только после своей попытки): https://youtu.be/DEyOq7Gpko4

Подвиг 3. Объявите класс Point так, чтобы объекты этого класса можно было создавать командами:

p1 = Point(10, 20)
p2 = Point(12, 5, 'red')
Здесь первые два значения - это координаты точки на плоскости (локальные свойства x, y),
а третий необязательный аргумент - цвет точки (локальное свойство color). Если цвет не указывается,
то он по умолчанию принимает значение black.

Создайте тысячу таких объектов с координатами (1, 1), (3, 3), (5, 5), ... то есть,
с увеличением на два для каждой новой точки. Каждый объект следует поместить в список points (по порядку).
Для второго объекта в списке points укажите цвет 'yellow'.

P.S. На экран в программе ничего выводить не нужно.
"""


class Point():
    def __init__(self, x: int, y: int, color: str = 'black'):
        self.x = x
        self.y = y
        self.color = color


if __name__ == '__main__':
    points = [Point(i, i, 'yellow') if ind == 2 else Point(i, i)
              for i, ind in zip(range(1, 2001, 2), range(1, 1001))]
    # далее - для проверки
    print(len(points))
    print(*[i.__dict__ for i in points], sep='\n')
